In [1]:
from  sqlalchemy import create_engine

import pandas as pd

In [55]:
data = pd.read_csv('../data/green_tripdata_2019-01.csv.gz',compression='gzip')

In [5]:
data.head()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2,2018-12-21 15:17:29,2018-12-21 15:18:57,N,1,264,264,5,0.00,3.0,0.5,0.5,0.00,0.0,NaN,0.3,4.30,2,1,NaN
1,2,2019-01-01 00:10:16,2019-01-01 00:16:32,N,1,97,49,2,0.86,6.0,0.5,0.5,0.00,0.0,NaN,0.3,7.30,2,1,NaN
2,2,2019-01-01 00:27:11,2019-01-01 00:31:38,N,1,49,189,2,0.66,4.5,0.5,0.5,0.00,0.0,NaN,0.3,5.80,1,1,NaN
3,2,2019-01-01 00:46:20,2019-01-01 01:04:54,N,1,189,17,2,2.68,13.5,0.5,0.5,2.96,0.0,NaN,0.3,19.71,1,1,NaN
4,2,2019-01-01 00:19:06,2019-01-01 00:39:43,N,1,82,258,1,4.53,18.0,0.5,0.5,0.00,0.0,NaN,0.3,19.30,2,1,NaN

20530

In [43]:
ref

datetime.date(2019, 1, 15)

In [23]:
data['lpep_pickup_datetime']=pd.to_datetime(data['lpep_pickup_datetime'])
data['lpep_dropoff_datetime']=pd.to_datetime(data['lpep_dropoff_datetime'])

In [10]:
#ingest data
engine  = create_engine('postgresql://root:root@localhost:5432/ny_taxi')
engine.connect()

In [11]:
print(pd.io.sql.get_schema(data,name='Green_taxi',con=engine))

CREATE TABLE "Green_taxi" (
	"VendorID" BIGINT,
	lpep_pickup_datetime TIMESTAMP WITHOUT TIME ZONE,
	lpep_dropoff_datetime TIMESTAMP WITHOUT TIME ZONE,
	store_and_fwd_flag TEXT,
	"RatecodeID" BIGINT,
	"PULocationID" BIGINT,
	"DOLocationID" BIGINT,
	passenger_count BIGINT,
	trip_distance FLOAT(53),
	fare_amount FLOAT(53),
	extra FLOAT(53),
	mta_tax FLOAT(53),
	tip_amount FLOAT(53),
	tolls_amount FLOAT(53),
	ehail_fee FLOAT(53),
	improvement_surcharge FLOAT(53),
	total_amount FLOAT(53),
	payment_type BIGINT,
	trip_type BIGINT,
	congestion_surcharge FLOAT(53)
)

In [14]:
data.columns

Index(['VendorID', 'lpep_pickup_datetime', 'lpep_dropoff_datetime',
       'store_and_fwd_flag', 'RatecodeID', 'PULocationID', 'DOLocationID',
       'passenger_count', 'trip_distance', 'fare_amount', 'extra', 'mta_tax',
       'tip_amount', 'tolls_amount', 'ehail_fee', 'improvement_surcharge',
       'total_amount', 'payment_type', 'trip_type', 'congestion_surcharge'],
      dtype='object')

In [15]:
data.to_sql(name='Green_taxi',con=engine,if_exists='replace',chunksize=5000)

126918

In [18]:
#ingest lookup table
data = pd.read_csv('../Data_Engineering/Week_1/data/taxi+_zone_lookup.csv')
print(pd.io.sql.get_schema(data,name='Green_taxi_lookup',con=engine))

CREATE TABLE "Green_taxi_lookup" (
	"LocationID" BIGINT,
	"Borough" TEXT,
	"Zone" TEXT,
	service_zone TEXT
)

In [20]:
data

     LocationID        Borough                     Zone service_zone
0             1            EWR           Newark Airport          EWR
1             2         Queens              Jamaica Bay    Boro Zone
2             3          Bronx  Allerton/Pelham Gardens    Boro Zone
3             4      Manhattan            Alphabet City  Yellow Zone
4             5  Staten Island            Arden Heights    Boro Zone
..          ...            ...                      ...          ...
260         261      Manhattan       World Trade Center  Yellow Zone
261         262      Manhattan           Yorkville East  Yellow Zone
262         263      Manhattan           Yorkville West  Yellow Zone
263         264        Unknown                       NV          NaN
264         265        Unknown                      NaN          NaN

[265 rows x 4 columns]

In [19]:
data.to_sql(name='Green_taxi_lookup',con=engine,if_exists='replace',chunksize=5000)

265

# Question 3
select count(*)  from "Green_taxi" where DATE(lpep_pickup_datetime)=CAST ('2019/01/15' AS DATE) and DATE(lpep_dropoff_datetime)=CAST('2
 019/01/15' AS DATE)

# Question 4
select  lpep_pickup_datetime from "Green_taxi" where trip_distance = (select max(trip_distance) from "Green_taxi")

# Question 5
select count (*) from "Green_taxi" where DATE (lpep_pick
 up_datetime)=CAST ('2019-01-01' AS DATE) and passenger_count=3
 select count (*) from "Green_taxi" where DATE (lpep_pick
 up_datetime)=CAST ('2019-01-01' AS DATE) and passenger_count=2

# Question 6
select "DOLocationID", tip_amount from   (select * into 
 temp_table from "Green_taxi" where "PULocationID" =( select "LocationID" from "
 Green_taxi_lookup" where "Zone"='Astoria')) as intial  where tip_amount = (sele
 ct max(tip) from temp_table)


with temp as ( select * from "Green_taxi" where "PULocationID" =( select "LocationID" from "Green_taxi_lookup" where "Zone"='Astoria'))
 select "DOLocationID", tip_amount ,b."Zone" from temp join 
"Green_taxi_lookup" b on temp. "DOLocationID" = b."LocationID" where tip_amount = (select max(tip_amount) from temp)